Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/include/pic32cz8110ca90176.h
#define FCR_CFM_DALCFG_SIZE            _UINT32_(0x00001000)    /*    4kB Memory segment type: flash */
#define FCR_CFM_DALCFG_PAGE_SIZE       _UINT32_(      4096)
#define FCR_CFM_DALCFG_NB_OF_PAGES     _UINT32_(         1)

#define FCR_CFM_USEROTP2_SIZE          _UINT32_(0x00001000)    /*    4kB Memory segment type: user_signatures */
#define FCR_CFM_USEROTP2_PAGE_SIZE     _UINT32_(      4096)
#define FCR_CFM_USEROTP2_NB_OF_PAGES   _UINT32_(         1)

#define FCR_CFM_BOOTCFG2_SIZE          _UINT32_(0x00001000)    /*    4kB Memory segment type: flash */
#define FCR_CFM_BOOTCFG2_PAGE_SIZE     _UINT32_(      4096)
#define FCR_CFM_BOOTCFG2_NB_OF_PAGES   _UINT32_(         1)

#define FCR_CFM_HSMCFG0_SIZE           _UINT32_(0x00001000)    /*    4kB Memory segment type: flash */
#define FCR_CFM_HSMCFG0_PAGE_SIZE      _UINT32_(      4096)
#define FCR_CFM_HSMCFG0_NB_OF_PAGES    _UINT32_(         1)

#define FCR_CFM_HSMCFG1_SIZE           _UINT32_(0x00001000)    /*    4kB Memory segment type: flash */
#define FCR_CFM_HSMCFG1_PAGE_SIZE      _UINT32_(      4096)
#define FCR_CFM_HSMCFG1_NB_OF_PAGES    _UINT32_(         1)

#define FCR_CFM_HSMCFG2_SIZE           _UINT32_(0x00001000)    /*    4kB Memory segment type: flash */
#define FCR_CFM_HSMCFG2_PAGE_SIZE      _UINT32_(      4096)
#define FCR_CFM_HSMCFG2_NB_OF_PAGES    _UINT32_(         1)

#define FCR_CFM_HSMCFG3_SIZE           _UINT32_(0x00001000)    /*    4kB Memory segment type: flash */
#define FCR_CFM_HSMCFG3_PAGE_SIZE      _UINT32_(      4096)
#define FCR_CFM_HSMCFG3_NB_OF_PAGES    _UINT32_(         1)

#define FCR_PFM_SIZE                   _UINT32_(0x00800000)    /* 8192kB Memory segment type: flash */
#define FCR_PFM_PAGE_SIZE              _UINT32_(      4096)
#define FCR_PFM_NB_OF_PAGES            _UINT32_(      2048)

#define DTCM_SIZE                      _UINT32_(0x00020000)    /*  128kB Memory segment type: ram */
#define FLEXRAM_SIZE                   _UINT32_(0x00100000)    /* 1024kB Memory segment type: ram */
#define APBA_SIZE                      _UINT32_(0x00800000)    /* 8192kB Memory segment type: io */
#define APBB_SIZE                      _UINT32_(0x00800000)    /* 8192kB Memory segment type: io */
#define APBC_SIZE                      _UINT32_(0x00800000)    /* 8192kB Memory segment type: io */
#define APBD_SIZE                      _UINT32_(0x00800000)    /* 8192kB Memory segment type: io */
#define APBE_SIZE                      _UINT32_(0x00800000)    /* 8192kB Memory segment type: io */
#define APBF_SIZE                      _UINT32_(0x00800000)    /* 8192kB Memory segment type: io */
#define SQI0_SFR_SIZE                  _UINT32_(0x00001000)    /*    4kB Memory segment type: io */
#define SQI1_SFR_SIZE                  _UINT32_(0x00001000)    /*    4kB Memory segment type: io */
#define USBHS0_SFR_SIZE                _UINT32_(0x00002000)    /*    8kB Memory segment type: io */
#define USBHS1_SFR_SIZE                _UINT32_(0x00002000)    /*    8kB Memory segment type: io */
#define HSM_SFR_SIZE                   _UINT32_(0x00000400)    /*    1kB Memory segment type: io */
#define EBI_CS0_SIZE                   _UINT32_(0x01000000)    /* 16384kB Memory segment type: ram */
#define EBI_CS1_SIZE                   _UINT32_(0x01000000)    /* 16384kB Memory segment type: ram */
#define EBI_CS2_SIZE                   _UINT32_(0x01000000)    /* 16384kB Memory segment type: ram */
#define EBI_CS3_SIZE                   _UINT32_(0x01000000)    /* 16384kB Memory segment type: ram */
#define SQI0_XIP_SIZE                  _UINT32_(0x10000000)    /* 262144kB Memory segment type: ram */
#define SQI1_XIP_SIZE                  _UINT32_(0x10000000)    /* 262144kB Memory segment type: ram */
#define PPB_SIZE                       _UINT32_(0x20000000)    /* 524288kB Memory segment type: io */
#define CM7H_ROM_TABLE_SIZE            _UINT32_(0x00000100)    /*    0kB Memory segment type: rom */

#define ITCM_ADDR                      _UINT32_(0x00000000)    /* ITCM base address (type: ram)*/
#define PRM_ROM_ADDR                   _UINT32_(0x04000000)    /* PRM_ROM base address (type: rom)*/
#define FCR_BFM_ADDR                   _UINT32_(0x08000000)    /* FCR_BFM base address (type: flash)*/
#define FCR_CFM_USERCFG1_ADDR          _UINT32_(0x0a000000)    /* FCR_CFM_USERCFG1 base address (type: flash)*/
#define FCR_CFM_USEROTP1_ADDR          _UINT32_(0x0a001000)    /* FCR_CFM_USEROTP1 base address (type: user_signatures)*/
#define FCR_CFM_BOOTCFG1_ADDR          _UINT32_(0x0a002000)    /* FCR_CFM_BOOTCFG1 base address (type: flash)*/
#define FCR_CFM_DALCFG_ADDR            _UINT32_(0x0a004000)    /* FCR_CFM_DALCFG base address (type: flash)*/
#define FCR_CFM_USEROTP2_ADDR          _UINT32_(0x0a009000)    /* FCR_CFM_USEROTP2 base address (type: user_signatures)*/
#define FCR_CFM_BOOTCFG2_ADDR          _UINT32_(0x0a00a000)    /* FCR_CFM_BOOTCFG2 base address (type: flash)*/
#define FCR_CFM_HSMCFG0_ADDR           _UINT32_(0x0a00c000)    /* FCR_CFM_HSMCFG0 base address (type: flash)*/
#define FCR_CFM_HSMCFG1_ADDR           _UINT32_(0x0a00d000)    /* FCR_CFM_HSMCFG1 base address (type: flash)*/
#define FCR_CFM_HSMCFG2_ADDR           _UINT32_(0x0a00e000)    /* FCR_CFM_HSMCFG2 base address (type: flash)*/
#define FCR_CFM_HSMCFG3_ADDR           _UINT32_(0x0a00f000)    /* FCR_CFM_HSMCFG3 base address (type: flash)*/
#define FCR_PFM_ADDR                   _UINT32_(0x0c000000)    /* FCR_PFM base address (type: flash)*/
#define DTCM_ADDR                      _UINT32_(0x20000000)    /* DTCM base address (type: ram)*/
#define FLEXRAM_ADDR                   _UINT32_(0x20020000)    /* FLEXRAM base address (type: ram)*/
#define APBA_ADDR                      _UINT32_(0x44000000)    /* APBA base address (type: io)*/
#define APBB_ADDR                      _UINT32_(0x44800000)    /* APBB base address (type: io)*/
#define APBC_ADDR                      _UINT32_(0x45000000)    /* APBC base address (type: io)*/
#define APBD_ADDR                      _UINT32_(0x45800000)    /* APBD base address (type: io)*/
#define APBE_ADDR                      _UINT32_(0x46000000)    /* APBE base address (type: io)*/
#define APBF_ADDR                      _UINT32_(0x46800000)    /* APBF base address (type: io)*/
#define SQI0_SFR_ADDR                  _UINT32_(0x4f008000)    /* SQI0_SFR base address (type: io)*/
#define SQI1_SFR_ADDR                  _UINT32_(0x4f009000)    /* SQI1_SFR base address (type: io)*/
#define USBHS0_SFR_ADDR                _UINT32_(0x4f010000)    /* USBHS0_SFR base address (type: io)*/
#define USBHS1_SFR_ADDR                _UINT32_(0x4f012000)    /* USBHS1_SFR base address (type: io)*/
#define HSM_SFR_ADDR                   _UINT32_(0x4f018000)    /* HSM_SFR base address (type: io)*/
#define EBI_CS0_ADDR                   _UINT32_(0x60000000)    /* EBI_CS0 base address (type: ram)*/
#define EBI_CS1_ADDR                   _UINT32_(0x61000000)    /* EBI_CS1 base address (type: ram)*/
#define EBI_CS2_ADDR                   _UINT32_(0x62000000)    /* EBI_CS2 base address (type: ram)*/
#define EBI_CS3_ADDR                   _UINT32_(0x63000000)    /* EBI_CS3 base address (type: ram)*/
#define SQI0_XIP_ADDR                  _UINT32_(0x80000000)    /* SQI0_XIP base address (type: ram)*/
#define SQI1_XIP_ADDR                  _UINT32_(0x90000000)    /* SQI1_XIP base address (type: ram)*/
#define PPB_ADDR                       _UINT32_(0xe0000000)    /* PPB base address (type: io)*/
#define CM7H_ROM_TABLE_ADDR            _UINT32_(0xe00fe000)    /* CM7H_ROM_TABLE base address (type: rom)*/

/* ************************************************************************** */
/*   DEVICE SIGNATURES FOR PIC32CZ8110CA90176                                 */
/* ************************************************************************** */
#define CHIP_DSU_DID                   _UINT32_(0X0920F053)

/* ************************************************************************** */
/*   ELECTRICAL DEFINITIONS FOR PIC32CZ8110CA90176                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* Event Generator IDs for C32CZ8110CA90176 */
/* ************************************************************************** */
#define EVENT_ID_GEN_SUPC_LVDET                           1 /* ID for SUPC event generator LVDET */
#define EVENT_ID_GEN_OSCCTRL_XOSC_FAIL                    2 /* ID for OSCCTRL event generator XOSC_FAIL */
#define EVENT_ID_GEN_OSC32KCTRL_XOSC32K_FAIL              3 /* ID for OSC32KCTRL event generator XOSC32K_FAIL */
#define EVENT_ID_GEN_FREQM_DONE                           4 /* ID for FREQM event generator DONE */
#define EVENT_ID_GEN_FREQM_WINMON                         5 /* ID for FREQM event generator WINMON */
#define EVENT_ID_GEN_RTC_PER_0                            6 /* ID for RTC event generator PER_0 */
#define EVENT_ID_GEN_RTC_PER_1                            7 /* ID for RTC event generator PER_1 */
#define EVENT_ID_GEN_RTC_PER_2                            8 /* ID for RTC event generator PER_2 */
#define EVENT_ID_GEN_RTC_PER_3                            9 /* ID for RTC event generator PER_3 */
#define EVENT_ID_GEN_RTC_PER_4                           10 /* ID for RTC event generator PER_4 */
#define EVENT_ID_GEN_RTC_PER_5                           11 /* ID for RTC event generator PER_5 */
#define EVENT_ID_GEN_RTC_PER_6                           12 /* ID for RTC event generator PER_6 */
#define EVENT_ID_GEN_RTC_PER_7                           13 /* ID for RTC event generator PER_7 */
#define EVENT_ID_GEN_RTC_CMP_0                           14 /* ID for RTC event generator CMP_0 */
#define EVENT_ID_GEN_RTC_CMP_1                           15 /* ID for RTC event generator CMP_1 */
#define EVENT_ID_GEN_RTC_CMP_2                           16 /* ID for RTC event generator CMP_2 */
#define EVENT_ID_GEN_RTC_CMP_3                           17 /* ID for RTC event generator CMP_3 */
#define EVENT_ID_GEN_RTC_TAMPER                          18 /* ID for RTC event generator TAMPER */
#define EVENT_ID_GEN_RTC_OVF                             19 /* ID for RTC event generator OVF */
#define EVENT_ID_GEN_RTC_PERD                            20 /* ID for RTC event generator PERD */
#define EVENT_ID_GEN_EIC_EXTINT_0                        21 /* ID for EIC event generator EXTINT_0 */
#define EVENT_ID_GEN_EIC_EXTINT_1                        22 /* ID for EIC event generator EXTINT_1 */
#define EVENT_ID_GEN_EIC_EXTINT_2                        23 /* ID for EIC event generator EXTINT_2 */
#define EVENT_ID_GEN_EIC_EXTINT_3                        24 /* ID for EIC event generator EXTINT_3 */
#define EVENT_ID_GEN_EIC_EXTINT_4                        25 /* ID for EIC event generator EXTINT_4 */
#define EVENT_ID_GEN_EIC_EXTINT_5                        26 /* ID for EIC event generator EXTINT_5 */
#define EVENT_ID_GEN_EIC_EXTINT_6                        27 /* ID for EIC event generator EXTINT_6 */
#define EVENT_ID_GEN_EIC_EXTINT_7                        28 /* ID for EIC event generator EXTINT_7 */
#define EVENT_ID_GEN_EIC_EXTINT_8                        29 /* ID for EIC event generator EXTINT_8 */
#define EVENT_ID_GEN_EIC_EXTINT_9                        30 /* ID for EIC event generator EXTINT_9 */
#define EVENT_ID_GEN_EIC_EXTINT_10                       31 /* ID for EIC event generator EXTINT_10 */
#define EVENT_ID_GEN_EIC_EXTINT_11                       32 /* ID for EIC event generator EXTINT_11 */
#define EVENT_ID_GEN_EIC_EXTINT_12                       33 /* ID for EIC event generator EXTINT_12 */
#define EVENT_ID_GEN_EIC_EXTINT_13                       34 /* ID for EIC event generator EXTINT_13 */
#define EVENT_ID_GEN_EIC_EXTINT_14                       35 /* ID for EIC event generator EXTINT_14 */
#define EVENT_ID_GEN_EIC_EXTINT_15                       36 /* ID for EIC event generator EXTINT_15 */
#define EVENT_ID_GEN_PAC_ACCERR                          37 /* ID for PAC event generator ACCERR */
#define EVENT_ID_GEN_DMA_CH_0                            38 /* ID for DMA event generator CH_0 */
#define EVENT_ID_GEN_DMA_CH_1                            39 /* ID for DMA event generator CH_1 */
#define EVENT_ID_GEN_DMA_CH_2                            40 /* ID for DMA event generator CH_2 */
#define EVENT_ID_GEN_DMA_CH_3                            41 /* ID for DMA event generator CH_3 */
#define EVENT_ID_GEN_DMA_CH_4                            42 /* ID for DMA event generator CH_4 */
#define EVENT_ID_GEN_DMA_CH_5                            43 /* ID for DMA event generator CH_5 */
#define EVENT_ID_GEN_DMA_CH_6                            44 /* ID for DMA event generator CH_6 */
#define EVENT_ID_GEN_DMA_CH_7                            45 /* ID for DMA event generator CH_7 */
#define EVENT_ID_GEN_DMA_CH_8                            46 /* ID for DMA event generator CH_8 */
#define EVENT_ID_GEN_DMA_CH_9                            47 /* ID for DMA event generator CH_9 */
#define EVENT_ID_GEN_DMA_CH_10                           48 /* ID for DMA event generator CH_10 */
#define EVENT_ID_GEN_DMA_CH_11                           49 /* ID for DMA event generator CH_11 */
#define EVENT_ID_GEN_DMA_CH_12                           50 /* ID for DMA event generator CH_12 */
#define EVENT_ID_GEN_DMA_CH_13                           51 /* ID for DMA event generator CH_13 */
#define EVENT_ID_GEN_DMA_CH_14                           52 /* ID for DMA event generator CH_14 */
#define EVENT_ID_GEN_DMA_CH_15                           53 /* ID for DMA event generator CH_15 */
#define EVENT_ID_GEN_TCC0_OVF                            54 /* ID for TCC0 event generator OVF */
#define EVENT_ID_GEN_TCC0_TRG                            55 /* ID for TCC0 event generator TRG */
#define EVENT_ID_GEN_TCC0_CNT                            56 /* ID for TCC0 event generator CNT */
#define EVENT_ID_GEN_TCC0_MC_0                           57 /* ID for TCC0 event generator MC_0 */
#define EVENT_ID_GEN_TCC0_MC_1                           58 /* ID for TCC0 event generator MC_1 */
#define EVENT_ID_GEN_TCC0_MC_2                           59 /* ID for TCC0 event generator MC_2 */
#define EVENT_ID_GEN_TCC0_MC_3                           60 /* ID for TCC0 event generator MC_3 */
#define EVENT_ID_GEN_TCC0_MC_4                           61 /* ID for TCC0 event generator MC_4 */
#define EVENT_ID_GEN_TCC0_MC_5                           62 /* ID for TCC0 event generator MC_5 */
#define EVENT_ID_GEN_TCC0_MC_6                           63 /* ID for TCC0 event generator MC_6 */
#define EVENT_ID_GEN_TCC0_MC_7                           64 /* ID for TCC0 event generator MC_7 */
#define EVENT_ID_GEN_TCC1_OVF                            65 /* ID for TCC1 event generator OVF */
#define EVENT_ID_GEN_TCC1_TRG                            66 /* ID for TCC1 event generator TRG */
#define EVENT_ID_GEN_TCC1_CNT                            67 /* ID for TCC1 event generator CNT */
#define EVENT_ID_GEN_TCC1_MC_0                           68 /* ID for TCC1 event generator MC_0 */
#define EVENT_ID_GEN_TCC1_MC_1                           69 /* ID for TCC1 event generator MC_1 */
#define EVENT_ID_GEN_TCC1_MC_2                           70 /* ID for TCC1 event generator MC_2 */
#define EVENT_ID_GEN_TCC1_MC_3                           71 /* ID for TCC1 event generator MC_3 */
#define EVENT_ID_GEN_TCC1_MC_4                           72 /* ID for TCC1 event generator MC_4 */
#define EVENT_ID_GEN_TCC1_MC_5                           73 /* ID for TCC1 event generator MC_5 */
#define EVENT_ID_GEN_TCC1_MC_6                           74 /* ID for TCC1 event generator MC_6 */
#define EVENT_ID_GEN_TCC1_MC_7                           75 /* ID for TCC1 event generator MC_7 */
#define EVENT_ID_GEN_TCC2_OVF                            76 /* ID for TCC2 event generator OVF */
#define EVENT_ID_GEN_TCC2_TRG                            77 /* ID for TCC2 event generator TRG */
#define EVENT_ID_GEN_TCC2_CNT                            78 /* ID for TCC2 event generator CNT */
#define EVENT_ID_GEN_TCC2_MC_0                           79 /* ID for TCC2 event generator MC_0 */
#define EVENT_ID_GEN_TCC2_MC_1                           80 /* ID for TCC2 event generator MC_1 */
#define EVENT_ID_GEN_TCC2_MC_2                           81 /* ID for TCC2 event generator MC_2 */
#define EVENT_ID_GEN_TCC2_MC_3                           82 /* ID for TCC2 event generator MC_3 */
#define EVENT_ID_GEN_TCC2_MC_4                           83 /* ID for TCC2 event generator MC_4 */
#define EVENT_ID_GEN_TCC2_MC_5                           84 /* ID for TCC2 event generator MC_5 */
#define EVENT_ID_GEN_TCC3_OVF                            85 /* ID for TCC3 event generator OVF */
#define EVENT_ID_GEN_TCC3_TRG                            86 /* ID for TCC3 event generator TRG */
#define EVENT_ID_GEN_TCC3_CNT                            87 /* ID for TCC3 event generator CNT */
#define EVENT_ID_GEN_TCC3_MC_0                           88 /* ID for TCC3 event generator MC_0 */
#define EVENT_ID_GEN_TCC3_MC_1                           89 /* ID for TCC3 event generator MC_1 */
#define EVENT_ID_GEN_TCC4_OVF                            90 /* ID for TCC4 event generator OVF */
#define EVENT_ID_GEN_TCC4_TRG                            91 /* ID for TCC4 event generator TRG */
#define EVENT_ID_GEN_TCC4_CNT                            92 /* ID for TCC4 event generator CNT */
#define EVENT_ID_GEN_TCC4_MC_0                           93 /* ID for TCC4 event generator MC_0 */
#define EVENT_ID_GEN_TCC4_MC_1                           94 /* ID for TCC4 event generator MC_1 */
#define EVENT_ID_GEN_TCC5_OVF                            95 /* ID for TCC5 event generator OVF */
#define EVENT_ID_GEN_TCC5_TRG                            96 /* ID for TCC5 event generator TRG */
#define EVENT_ID_GEN_TCC5_CNT                            97 /* ID for TCC5 event generator CNT */
#define EVENT_ID_GEN_TCC5_MC_0                           98 /* ID for TCC5 event generator MC_0 */
#define EVENT_ID_GEN_TCC5_MC_1                           99 /* ID for TCC5 event generator MC_1 */
#define EVENT_ID_GEN_TCC6_OVF                           100 /* ID for TCC6 event generator OVF */
#define EVENT_ID_GEN_TCC6_TRG                           101 /* ID for TCC6 event generator TRG */
#define EVENT_ID_GEN_TCC6_CNT                           102 /* ID for TCC6 event generator CNT */
#define EVENT_ID_GEN_TCC6_MC_0                          103 /* ID for TCC6 event generator MC_0 */
#define EVENT_ID_GEN_TCC6_MC_1                          104 /* ID for TCC6 event generator MC_1 */
#define EVENT_ID_GEN_TCC7_OVF                           105 /* ID for TCC7 event generator OVF */
#define EVENT_ID_GEN_TCC7_TRG                           106 /* ID for TCC7 event generator TRG */
#define EVENT_ID_GEN_TCC7_CNT                           107 /* ID for TCC7 event generator CNT */
#define EVENT_ID_GEN_TCC7_MC_0                          108 /* ID for TCC7 event generator MC_0 */
#define EVENT_ID_GEN_TCC7_MC_1                          109 /* ID for TCC7 event generator MC_1 */
#define EVENT_ID_GEN_TCC8_OVF                           110 /* ID for TCC8 event generator OVF */
#define EVENT_ID_GEN_TCC8_TRG                           111 /* ID for TCC8 event generator TRG */
#define EVENT_ID_GEN_TCC8_CNT                           112 /* ID for TCC8 event generator CNT */
#define EVENT_ID_GEN_TCC8_MC_0                          113 /* ID for TCC8 event generator MC_0 */
#define EVENT_ID_GEN_TCC8_MC_1                          114 /* ID for TCC8 event generator MC_1 */
#define EVENT_ID_GEN_TCC9_OVF                           115 /* ID for TCC9 event generator OVF */
#define EVENT_ID_GEN_TCC9_TRG                           116 /* ID for TCC9 event generator TRG */
#define EVENT_ID_GEN_TCC9_CNT                           117 /* ID for TCC9 event generator CNT */
#define EVENT_ID_GEN_TCC9_MC_0                          118 /* ID for TCC9 event generator MC_0 */
#define EVENT_ID_GEN_TCC9_MC_1                          119 /* ID for TCC9 event generator MC_1 */
#define EVENT_ID_GEN_TCC9_MC_2                          120 /* ID for TCC9 event generator MC_2 */
#define EVENT_ID_GEN_TCC9_MC_3                          121 /* ID for TCC9 event generator MC_3 */
#define EVENT_ID_GEN_TCC9_MC_4                          122 /* ID for TCC9 event generator MC_4 */
#define EVENT_ID_GEN_TCC9_MC_5                          123 /* ID for TCC9 event generator MC_5 */
#define EVENT_ID_GEN_ADC_CHRDYC_0                       124 /* ID for ADC event generator CHRDYC_0 */
#define EVENT_ID_GEN_ADC_CHRDYC_1                       125 /* ID for ADC event generator CHRDYC_1 */
#define EVENT_ID_GEN_ADC_CHRDYC_2                       126 /* ID for ADC event generator CHRDYC_2 */
#define EVENT_ID_GEN_ADC_CHRDYC_3                       127 /* ID for ADC event generator CHRDYC_3 */
#define EVENT_ID_GEN_ADC_CMP_0                          128 /* ID for ADC event generator CMP_0 */
#define EVENT_ID_GEN_ADC_CMP_1                          129 /* ID for ADC event generator CMP_1 */
#define EVENT_ID_GEN_ADC_CMP_2                          130 /* ID for ADC event generator CMP_2 */
#define EVENT_ID_GEN_ADC_CMP_3                          131 /* ID for ADC event generator CMP_3 */
#define EVENT_ID_GEN_AC_COMP_0                          132 /* ID for AC event generator COMP_0 */
#define EVENT_ID_GEN_AC_COMP_1                          133 /* ID for AC event generator COMP_1 */
#define EVENT_ID_GEN_AC_WIN_0                           134 /* ID for AC event generator WIN_0 */
#define EVENT_ID_GEN_PTC_EOC                            135 /* ID for PTC event generator EOC */
#define EVENT_ID_GEN_PTC_WCOMP                          136 /* ID for PTC event generator WCOMP */
#define EVENT_ID_GEN_ETH_TSU_CMP                        137 /* ID for ETH event generator TSU_CMP */
#define EVENT_ID_GEN_TRNG_READY                         138 /* ID for TRNG event generator READY */

